Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F13A.tmx
Source language: en_us
Languages: zh_cn

source: Mother's hands
zh_cn: 妈妈的手

source: Night after night, she came to tuck me in, even long after my childhood years.
zh_cn: 每晚，她都来为我盖被子,甚至在我过了儿童期之后仍然如此。

source: Following her longstanding custom, she'd lean down and push my long hair out of the way, then kiss my forehead.
zh_cn: 按照她长期的习惯，她都会俯下身来拂开我的长发然后亲吻我的额头。

source: I don't remember when it first started annoying me - her hand pushing my hair that way.
zh_cn: 我不记得从什么时候开始她那样拂开我的头发让我感到烦扰。

source: But it did annoy me, for they felt work-worn and rough against my young skin.
zh_cn: 但是她那样做确实激怒了我，因为我幼嫩的皮肤感觉到了累年工作造成的茧的摩擦。

source: Finally,one night, I lashed out at her: "Don't do that anymore - your hands are too rough!" She didn't say anything in reply.
zh_cn: 最终，有一天晚上，我冲她大声嚷道：“别再那样做了—你的手太粗糙了！”她沉默不语。

source: But never again did my mother close out my day with that familiar expression of her love.
zh_cn: 但是从此以后，我的妈妈不再用她那让我熟悉的爱的表达方式来结束我的一天了。

source: Lying awake long afterward, my words haunted me. But pride stifled my conscience, and I didn't tell her I was sorry.
zh_cn: 躺在床上久久不能入眠，我说的话萦绕在我的脑海，但是骄傲蒙蔽了我的良知，我没有告诉她我很抱歉。

source: Time after time, with the passing years, my thoughts returned to that night.
zh_cn: 一天又一天，很多年过去了，我的思绪又回到了那天晚上。

source: By then I missed my mother's hands, missed her good night kiss upon my forehead.
zh_cn: 这时，我开始怀念妈妈的手，怀念她的在我额头上留下的晚安之吻。

source: Sometimes the incident seemed very close, sometimes far away.
zh_cn: 有时，这件事离我很近，有时又离我很远。

source: But always it lurked, hauntingly, in the back of my mind.
zh_cn: 但是它始终潜伏，萦绕在我的脑海深处。

source: Well, then years have passed, and I'm not a little girl anymore.
zh_cn: 现在许多年过去了，我不再是那个小女孩了。

source: Mom is in her mid-seventies, and those hands I once thought to be so rough are still doing things for me and my family.
zh_cn: 妈妈已经七十五岁了，但她那双我曾认为粗糙的手仍在为我和我的家庭操劳着。

source: She's been our doctor, reaching into a medicine cabinet for the remedy to clam a young girl's stomach or sooth a boy's scraped knee.
zh_cn: 她曾是我们的医生，从医药柜里找出药缓解小女孩的腹疼和小男孩的膝盖擦伤。

source: She cooks the best fried chicken in the world... gets stains out of blue jeans like I never could... and still insists on dishing out ice cream at any hour of the day or night.
zh_cn: 她能煮出世界上最好吃的炸鸡和洗掉我从不曾洗掉过的牛仔裤上的污渍还有仍然坚持着每天任何时刻都去盛出冰激凌。

source: Through the years, my mother's hands have put in countless hours of toil, and most of hers were before automatic washers!
zh_cn: 这些年，妈妈的手经历过无数小时的操劳，而她操劳的大部分时间是在自动洗衣机问世之前。

source: Now, our own children are grown and gone.
zh_cn: 现在，我们自己的孩子已经长大离开了。

source: Mom no longer has Dad, and on special occasions, I find myself drawn next door to spend the night with her.
zh_cn: 妈妈没有了爸爸，在一些特殊的日子，我发现我自己会从隔壁搬去和她共度夜晚。

source: So it was that late on Thanksgiving Eve, as I drifted into sleep in the bedroom of my youth. a familiar hand hesitantly stole across my face to brush the hair from my forehead. Then a kiss, ever so gently, touched my brow.
zh_cn: 所以，在一次感恩节前夜的深夜，我正在我小时候的房间里睡得正香，一只熟悉的手迟疑地拂过我的脸颊，将我的额头上的头发拨开，然后一个吻轻轻地触碰了我的眉毛。

source: In my memory, for the thousandth time, I recalled the night my surly young voice complained: "Don't do that anymore - your hands are too rough!"
zh_cn: 在我的记忆中，我上千次回忆起那天晚上，我用无礼稚嫩的声音抱怨道：“别再那样做了，你的手太粗糙了。”

source: Catching Mom's hand in hand, I blurted out how sorry I was for that night.
zh_cn: 将妈妈的手抓在手中，我脱口而出对于那天晚上我是多么的抱歉。

source: I thought she'd remember, as I did, but Mom didn't know what I was talking about.
zh_cn: 我想她会像我一样记得，但是妈妈根本不知道我在说些什么。

source: She had forgotten - and forgiven - long ago.
zh_cn: 她很久之前就已忘掉那件事并原谅我了。

source: That night I fell asleep with a new appreciation for my gentle mother and her caring hands.
zh_cn: 那天晚上，我带着对我温柔的妈妈和她那双充满关怀的双手全新的欣赏入睡。

source: And the guilt I had carried around for so long was nowhere to be found.
zh_cn: 我长期以来带着的愧疚感也烟消云散了。
